app/Views/layout/admin.php

use App\Models\AdminModel;

$adminModel = new AdminModel();
$admin = $adminModel->asObject()->first();
---
SELECT *
FROM `admin`
 LIMIT 1