app/Controllers/Admin.php

    public function index()
    {
        if (session()->get('role') != 1) {
            return redirect()->to('auth');
        }

        $data['menu'] = [
            'dashboard' => 'show active', 'current-page',
            'pegawai' => '',
            'jabatan' => '',
            'pengaturan_absen' => '',
            'absensi' => ''
        ];

        // Plugin Tambahan
        $data['plugin'] = '

        ';

        $data['judul_halaman'] = 'Dashboard | Megadata';
        $data['admin'] = $this->AdminModel->asObject()->first();
        $data['pegawai'] = $this->PegawaiModel->asObject()->findAll();
        $data['jabatan'] = $this->JabatanModel->asObject()->findAll();
---
SELECT *
FROM `admin`
 LIMIT 1
SELECT *
FROM `pegawai`
SELECT *
FROM `jabatan`

        $data['judul_halaman'] = 'Data Presensi | Megadata';

        $data['absensi'] = $this->AbsenModel->getByTanggal(date('d-M-Y', time()));
        $data['riwayat_absen'] = $this->AbsenModel
            ->orderBy('id_absensi', 'DESC')
            ->get()->getResultObject();
        $data['admin'] = $this->AdminModel->asObject()->first();
---
SELECT *
FROM `absensi`
ORDER BY `id_absensi` DESC
SELECT *
FROM `admin`
 LIMIT 1


        $data['absensi'] = $this->AbsenModel->getByKode($kode_absen);
        $data['detail_absensi'] = $this->AbsenDetailModel->getAllByKodeAbsen($kode_absen);
        $data['admin'] = $this->AdminModel->asObject()->first();
---
SELECT *
FROM `admin`
 LIMIT 1

    public function absen_pegawai($kode_absen, $id_pegawai)
    {
        if (session()->get('role') != 1) {
            return redirect()->to('auth');
        }

        $data['menu'] = [
            'dashboard' => '',
            'pegawai' => '',
            'jabatan' => '',
            'pengaturan_absen' => '',
            'absensi' => 'show active', 'current-page'
        ];

        $data['plugin'] = '
        ';

        $data['judul_halaman'] = 'Data Presensi Pegawai | Megadata';

        $data['absensi'] = $this->AbsenModel->getByKode($kode_absen);
        $data['detail_absensi'] = $this->AbsenDetailModel->getByKodeAndIdPegawai($kode_absen, $id_pegawai);
        $data['pengaturan'] = $this->PengaturanModel->asObject()->first();
        $data['admin'] = $this->AdminModel->asObject()->first();
---
SELECT *
FROM `admin`
 LIMIT 1

    public function izin_pegawai($kode_absen, $id_pegawai)
    {
        if (session()->get('role') != 1) {
            return redirect()->to('auth');
        }

        $data['menu'] = [
            'dashboard' => '',
            'pegawai' => '',
            'jabatan' => '',
            'pengaturan_absen' => '',
            'absensi' => 'show active', 'current-page'
        ];

        $data['plugin'] = '
        ';

        $data['judul_halaman'] = 'Data Izin Pegawai | Megadata';

        $data['absensi'] = $this->AbsenModel->getByKode($kode_absen);
        $data['detail_absensi'] = $this->AbsenDetailModel->getByKodeAndIdPegawai($kode_absen, $id_pegawai);
        $data['pengaturan'] = $this->PengaturanModel->asObject()->first();
        $data['admin'] = $this->AdminModel->asObject()->first();
---
SELECT *
FROM `admin`
 LIMIT 1