app/Controllers/Auth.php

    public function index()
    {
        if (session()->get('role') != null) {
            if (session()->get('role') == 1) {
                return redirect()->to('admin');
            }

            if (session()->get('role') == 2) {
                return redirect()->to('pegawai');
            }
        }

        $admin = $this->AdminModel->asObject()->first();
---
SELECT *
FROM `admin`
 LIMIT 1