app/Models/PegawaiModel.php

    public function getByEmail($email)
    {
        return $this
            ->join('jabatan', 'jabatan.id_jabatan=pegawai.jabatan')
            ->where('pegawai.email', $email)
            ->get()->getRowObject();
---
SELECT *
FROM `pegawai`
JOIN `jabatan` ON `jabatan`.`id_jabatan`=`pegawai`.`jabatan`
WHERE `pegawai`.`email` = 'guido@gmail.com'